export const blue = [
    { num: 1, msg: 'สำนักงานอธิการบดี', detail: '' },
    { num: 4, msg: 'กองบริหารงานวิชาการ', detail: '' },
    { num: 8, msg: 'คณะศึกษาศาสตร์ - อาคารศึกษาศาสตร์ 3 (ตึกส้ม)', detail: 'เรียกกันว่า ตึกส้ม\nชั้น5 มีห้องประชุมหลวงพ่อวัดไร่ขิงอุปถัมภ์' },
    { num: 9, msg: 'คณะศึกษาศาสตร์ - อาคารศึกษาศาสตร์ 1 (อาคาร A2 เดิม)', detail: 'เดิมชื่ออาคาร A2\nปัจจุบันเป็นอาคารเรียนและห้องพักรับรองอาจารย์' },
    { num: 10, msg: 'คณะศึกษาศาสตร์ - อาคารโสมสวลี', detail: 'ชั้นล่างเป็นโรงอาหาร\nชั้น2เป็นศูนย์ออกกำลังกายและห้องพักอาจารย์\nชั้น3เป็นห้องประชุมเอนกประสงค์\nชั้น 4 เป็นห้องประชุมสัมมนา' },
    { num: 11, msg: 'คณะศึกษาศาสตร์ - อาคารศึกษาศาสตร์ 2', detail: 'เป็นอาคารเรียนหลังแรกของคณะศึกษาศาสตร์\nปัจจุบันเป็นอาคารเรียนของภาควิชาเทคโนโลยีการศึกษา' },
    { num: 25, msg: 'คณะอักษรศาสตร์ - อาคาร 50 ปี', detail: 'ชั้น 1 มีตู้ธนาคารและร้านถ่ายเอกสารให้บริการแก่นักศึกษา มีร้านชานมไข่มุก, ตู้น้ำเต่าบิน, B2S และโรงอาหาร\nตั้งแต่พื้นที่ชั้น 2 เป็นห้องเรียนและห้องพักครูของสาขาวิชาด้านภาษา' },
    { num: 26, msg: 'คณะอักษรศาสตร์ - อาคาร 36 ปี', detail: 'ชั้น 4 มีบริการเครื่องคอมพิวเตอร์ พิมพ์งานเอกสารและต่างๆ \nชั้น 3 ห้อง 302และ303 เป็นห้องสำหรับการเรียนการสอน\nใต้อาคารมีบริการ WI-FI' },
    { num: 27, msg: 'คณะอักษรศาสตร์ - อาคารวชิรมงกุฎ', detail: 'ชั้น 4 ห้อง 411 นักศึกษาสามารถเข้าไปค้นหาข้อมูลงานวิจัยของนักศึกษาได้ \nใต้อาคารมีบริการ WI-FI' },
    { num: 28, msg: 'คณะอักษรศาสตร์ - อาคารอักษร 1', detail: 'บริเวณชั้น 1 เป็นที่ติดต่อ สอบถาม หรือส่งเอกสารสำคัญของนักศึกษาคณะอักษรศาสตร์ \nบริเวณชั้น 2 เป็นห้องพักครูสาขาวิชาภูมิศาสตร์ โดยบริเวณหน้าห้องจะมีการจัดแสดงหินแร่ และมีโต๊ะเก้าอี้เพื่อให้นักศึกษานั่งทำงานได้' },
    { num: 31, msg: 'โรงอาหารสระแก้ว: ศูนย์รวมร้านอาหารต่างๆ', detail: 'ศูนย์รวมร้านอาหารต่างๆ -อยู่ใกล้กับคณะอักษรศาสตร์และเภสัชศาสตร์' },
    { num: 34, msg: 'คณะเภสัชศาสตร์', detail: 'เข้าไปในอาคารจะเจอกับรูปปั้นอนุสรณ์เภสัชกร รองศาสตราจารย์ ดร.ประโชติ เปล่งวิทยา –ชั้น1 เป็นโซน Coworking Space –ชั้น 2-4 เป็นห้องปฏิบัติการทางเภสัชศาสตร์' },
    { num: 35, msg: 'คณะเภสัชศาสตร์ - อาคารปฏิบัติการควบคุมและประเมินคุณภาพ', detail: 'เหมือนเป็นอาคารแฝดของตึกดาวเพราะมีทางเชื่อมถึงกัน –เป็นอาคารสำหรับงานวิจัยที่ได้มาตรฐาน –หรือเรียกว่าตึก 6 ชั้น' },
    { num: 36, msg: 'คณะเภสัชศาสตร์ - อาคารเทคโนโลยีเภสัชกรรม (ตึกฟาร์เทค)', detail: 'หรือเรียกว่า ตึกฟาร์เทค –เป็นตึก 2 ชั้นใช้ในการเรียนปฏิบัติการและทำวิจัย' },
    { num: 39, msg: 'คณะเภสัชศาสตร์อาคารนำร่อง: หน่วยภูมิปัญญาและเทคโนโลยีทางเภสัชศาสตร์และสุขภาพ', detail: '-มีผลการดำเนินงานจนเป็นรูปธรรมจนได้รับการยอมรับจัดตั้งเป็นหน่วยธุรกรรม' },
    { num: 40, msg: 'อาคารศูนย์เรียนรวมเฉลิมพระเกียรติ', detail: 'ชั้น1จะมีร้าน Amazon –ชั้น2 เป็นห้องเรียนเกี่ยวกับภาควิชาวิศกรรมไฟฟ้า' },
    { num: 41, msg: 'สำนักดิจิทัลเทคโนโลยี', detail: 'มีห้องปฏิบัติการคอมพิวเตอร์ –ดูแลเกี่ยวกับ SU NET SERVICE –บริการให้เช่าโปรแกรม Adobe Creative Cloud' },
    { num: 47, msg: 'คณะวิศวกรรมศาสตร์และเทคโนโลยีอุตสาหกรรม', detail: 'ติดต่ออาจารย์ คณะ สาขาอิเล็คทรอนิกส์และระบบคอมพิวเตอร์ที่ ชั้่น 5  -ชั้น 1 มีงานบริหารการศึกษาและที่ถ่ายเอกสาร - โรงอาหารใต้ตึก' },
    { num: 55, msg: 'คณะวิทยาศาสตร์ - อาคารวิทยาศาสตร์ 1', detail: 'มี co-working space เรียกว่า “AA” -เป็นศูนย์รวมของภาควิชาแทบทั้งหมดของคณะวิทยาศาสตร์' },
    { num: 56, msg: 'คณะวิทยาศาสตร์ - อาคารวิทยาศาสตร์ 2', detail: 'มีเทวาลัยพิฆเนศเป็นจุดสังเกต –มีสำนักงานเด็กวมว.' },
    { num: 57, msg: 'คณะวิทยาศาสตร์ - อาคารวิทยาศาสตร์ 3', detail: 'มีสำนักงานภาควิชาเคมีและฟิสิกส์ -มีสำนักงานหน่วยรักษาความปลอดภัยของคณะ' },
    { num: 58, msg: 'คณะวิทยาศาสตร์ - อาคารวิทยาศาสตร์ 4', detail: 'มีลิฟต์กินคน ปิดประตูอัตโนมัติภายในเวลาเพียง10วินาทีนับจากประตูลิฟต์เริ่มเปิด -มีศูนย์เครื่องมือทางวิทยาศาสตร์เกือบครบวงจรในด้านงานวิเคราะห์และยืนยันอัตลักษณ์ของสาร' },
    { num: 59, msg: 'คณะวิทยาศาสตร์ - อาคารเรียนรวม(รวท)', detail: 'มี co-working space เรียกว่า “ห้องกระจก” -ชั้น2เป็นห้องเลคเชอร์ใหญ่สองห้อง หันหน้าเข้าหากัน' },
    { num: 68, msg: 'โรงพิมพ์มหาวิทยาลัยศิลปากร', detail: '' },
    { num: 69, msg: 'คณะจิตรกรรมประติมากรรมและภาพพิมพ์', detail: '' }
];

export const sky_blue = [
    { num: 3, msg: 'อาคารวัชรนาฏยสภา (A4)', detail: 'หรือโรงละครวัชรนาฏยสภา (A4) สำหรับสาขาวิชาการละคร' },
    { num: 15, msg: 'อาคารเทพศิลป์ 2', detail: 'จะรับสมัครนักเรียนชั้นอนุบาลปีที่ 1' },
    { num: 16, msg: 'อาคารเทพศิลป์ 15', detail: 'จะรับสมัครนักเรียนชั้นมัธยมศึกษาปีที่ 1 และ 4' },
    { num: 17, msg: 'อาคารเทพศิลป์ 16', detail: 'จะรับสมัครนักเรียนชั้นประถมศึกษาปีที่ 1' },
    { num: 18, msg: 'อาคารเทพศิลป์ 17', detail: '' },
    { num: 21, msg: 'อาคารทรงพล 1', detail: '' },
    { num: 22, msg: 'อาคารทรงพล 2', detail: '' },
    { num: 23, msg: 'อาคารทรงพล 3', detail: '' },
    { num: 24, msg: 'อาคารทรงพล 4', detail: '' },
    { num: 29, msg: 'คณะอักษรศาสตร์ - อาคารอักษร 3', detail: '' },
    { num: 30, msg: 'คณะอักษรศาสตร์ - อาคารอักษร 2', detail: '' },
    { num: 34, msg: 'คณะเภสัชศาสตร์', detail: 'เข้าไปในอาคารจะเจอกับรูปปั้นอนุสรณ์เภสัชกร รองศาสตราจารย์ ดร.ประโชติ เปล่งวิทยา –ชั้น1 เป็นโซน Coworking Space –ชั้น 2-4 เป็นห้องปฏิบัติการทางเภสัชศาสตร์' },
    { num: 37, msg: 'คณะเภสัชศาสตร์ อาคารส่วนปาฐอาศรม “ประโชติ เปล่งวิทยา” (ตึกดาว หรือ ตึกประโชติ)', detail: 'เรียกกันว่า ตึกดาว หรือ ตึกประโชติ –มีห้องเรียนขนาดใหญ่ 4 ห้อง ประโชติ1 ประโชติ2 ห้องชะลอ โสฬสจินดาและห้องจำลอง สุวคนธ์ สองห้องหลังคือชื่อบุคคลสำคัญในวงการเภสัชศาสตร์ของไทย' },
    { num: 38, msg: 'สถาบันหมวกนิรภัย', detail: 'เป็นสถานที่ทดสอบหมวกนิรภัยหรือหมวกกันน็อค ที่จำหน่ายตามท้องตลาดตามเกณฑ์มาตรฐานเพื่อคุ้มครองความปลอดภัยของผู้บริโภค' },
    { num: 44, msg: 'สำนักงานบริหารการวิจัย นวัตกรรมและการสร้างสรรค์', detail: '' },
    { num: 48, msg: 'หอศิลป์บรมราชกุมารี - อาคารศิลป์ พีระศรี 4', detail: '' },
    { num: 49, msg: 'อาคารศิลป์ พีระศรี 2', detail: '' },
    { num: 50, msg: 'คณะมัณฑนศิลป์ - อาคารศิลป์ พีระศรี 3', detail: '' },
    { num: 51, msg: 'อาคารศิลป์ พีระศรี 1', detail: '' },
    { num: 70, msg: 'กลุ่มอาคารปฏิบัติงานคณะมัณฑนศิลป์', detail: '' }
];

export const orange = [
    { num: 6, msg: 'หอพักทับแก้ว 2', detail: 'เป็นหอพักนักศึกษาชาย –พักห้องละ2-3คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    { num: 7, msg: 'หอพักทับแก้ว 1', detail: 'เป็นหอพักนักศึกษาชาย –พักห้องละ2-3คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    {num: 19, msg: 'เภสัชศาลา', detail: 'เป็นร้านขายยาที่มีเภสัชกรดูแลตลอดทั้งวัน -เป็นสถานปฏิบัติการเภสัชชุมชน'},
    {num: 20, msg: 'ศูนย์รักษาความปลอดภัย', detail: '–ควบคุมการดูแลเกี่ยวกับความปลอดภัยต่างๆในมหาวิทยาลัย'},
    {num: 42, msg: 'หอสมุดกลาง', detail: '–มีคลังหนังสือและวิทยานิพนธ์ -มีคาเฟ่ภายในห้องสมุดชั้นแรก'},
    {num: 43, msg: 'อาคารหม่อมหลวงปิ่น มาลากุล', detail:  '-มีบอร์ดเกมส์และห้องคาราโอเกะ -มีศูนย์คอมพิวเตอร์ของมหาวิทยาลัย'},
    { num: 54, msg: 'หอพักทับแก้ว3', detail: 'เป็นหอพักนักศึกษาชาย –พักห้องละ 4 คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    { num: 61, msg: 'หอพักเพชรรัตน 1', detail: 'เป็นหอพักนักศึกษาหญิง –พักห้องละ2-3คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    { num: 62, msg: 'หอพักเพชรรัตน 2', detail: 'เป็นหอพักนักศึกษาหญิง –พักห้องละ2-3คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    { num: 63, msg: 'หอพักเพชรรัตน 3', detail: 'เป็นหอพักนักศึกษาหญิง –พักห้องละ 2 คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    { num: 64, msg: 'หอพักเพชรรัตน 4', detail: 'เป็นหอพักนักศึกษาหญิง –พักห้องละ 2 คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    { num: 65, msg: 'หอพักเพชรรัตน 5', detail: 'เป็นหอพักนักศึกษาหญิง –พักห้องละ 3 คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    { num: 66, msg: 'หอพักเพชรรัตน 6', detail: 'เป็นหอพักนักศึกษาหญิง –พักห้องละ 2 คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' },
    { num: 67, msg: 'หอพักเพชรรัตน 7', detail: 'เป็นหอพักนักศึกษาหญิง –พักห้องละ 4 คน  -มีสิ่งอำนวยความสะดวกต่างๆมากมาย' }
];

export const yellow = [
    { num: 31, msg: 'โรงอาหารสระแก้ว', detail: 'ศูนย์รวมร้านอาหารต่างๆ -อยู่ใกล้กับคณะอักษรศาสตร์และเภสัชศาสตร์' },
    { num: 45, msg: 'โรงอาหารเพชรรัตน์', detail: 'ศูนย์รวมร้านอาหารต่างๆ –อยู่ใกล้กับคณะวิทยาศาสตร์และวิศวกรรมศาสตร์' }
];

export const green = [
    { num: 2, msg: 'สะพานสระแก้ว', detail: 'เป็นสะพานข้ามสระน้ำใจกลางมหาวิทยาลัย-เป็นจุดชมวิวเหมาะแก่การถ่ายรูป –เป็นสถานที่พักผ่อนหย่อนใจ' },
    { num: 32, msg: 'ศาลาสระแก้ว', detail: 'ใช้จัดกิจกรรมต่างๆของมหาวิทยาลัย –บางวันมีตลาดนัด –ตั้งริมสระแก้วและตรงข้ามกับโรงอาหารสระแก้ว' }
];

export const red = [
    { num: 46, msg: 'อาคารเพชรรัตน-สุวัทนา (อาคารปฏิบัติการกีฬาใหม่)', detail: 'มีสนามบาสเก็ตบอล วอลเล่บอลและแบดมินตัน' },
    { num: 53, msg: 'สนามกีฬากลางแจ้ง', detail: 'มีสนามเทนนิส บาสเกตบอล ฟุตซอล เปตอง ตะกร้อ ฟุตบอล บาร์โหน ลู่กรีฑา' }
];
